<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" 
		  "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
	<link rel="stylesheet" type="text/css" href="../jpe-help.css" />

  <meta name="generator" content=
  "HTML Tidy for Linux (vers 25 March 2009), see www.w3.org">
  <meta http-equiv="CONTENT-TYPE" content=
  "text/html; charset=us-ascii">
  <meta name="author" content="Sylvain Reynal">
  <meta name="translation" content=
  "Jobst Hoffmann, Benjamin Poniatowski, Stephan Schulte">

  <title>jPicEdt 1.6 Hilfe &ndash; Ver&auml;ndern von Formen</title>
</head>

<body>
  <h2>Ver&auml;ndern von Formen</h2>

  <p>Um ein Objekt zu ver&auml;ndern, klicken Sie zuerst auf einen Teil des
  Umrisses, um es so auszuw&auml;hlen.</p>

  <ul>
    <li>Wenn die <img src="../img/action.editorkit.EditPointsMode.png"
    alt="Icon: EditPointsMode" > Schaltfl&auml;che inaktiv ist (LOCAL mode,
    siehe auch <a href= "actions.html#globallocalmode">Globaler/lokaler
    Punktbearbeitungsmodus</a>), wird das ausgew&auml;hlte Element in
    gr&uuml;n hervorgehoben und seine Ankerpunkte werden zu kleinen Quadraten
    (ausgenommen sind Gruppen, wobei Sie die Verfahrensweise von Gruppe zu
    Gruppe durch einen Klick mit der <a href= "mouse.html#Mouse">Maustaste
    II</a> auf die gew&uuml;nschte Gruppe &auml;ndern k&ouml;nnen, klicken Sie
    dazu in dem nun erscheinenden Pop-up-Men&uuml; <b>Highlightmodus
    umschalten</b> an).</li>

    <li>Ist der Modus auf GLOBAL gesetzt
    (d. h. <img src="../img/action.editorkit.EditPointsMode.png"
    alt="EditPointsMode" > ist aktiviert worden), dann wird die Auswahl global
    in rot hervorgehoben. Es werden acht Punkte angezeigt, welche es erlauben,
    den kompletten ausgew&auml;hlten Inhalt zu skalieren.</li>

    <li>Der eingebaute Attribut-Editor wird entsprechend zu den Eigenschaften
    des ausgew&auml;hlten Objekts aktualisiert (z.B.  F&uuml;llung einer
    Fl&auml;che mit Farbe &ndash; zum F&uuml;llen mit Farbe und/oder einem
    Muster vgl. <a href= "filling.html#Fill">Das F&uuml;llen von
    Fl&auml;chen</a> &ndash;, Liniendicke, Pfeile&hellip;).</li>
  </ul>

  <p>Sie k&ouml;nnen einen Ankerpunkt verschieben, indem sie mit der
  <a href="mouse.html#Mouse">Maustaste I</a> darauf klicken, diese
  gedr&uuml;ckt halten und die Maus bewegen, oder sie k&ouml;nnen die ganze
  Auswahl verschieben, indem sie irgendwo auf den Pfad klicken.  Wenn
  eine <b>Gruppe</b> von Objekten verschoben werden soll, dient das
  angeklickte Objekt als Referenz f&uuml;r die <b>Ausrichtung</b> am
  Gitter.</p>

  <p>Wenn Sie die Position des Objekts pr&auml;zise festlegen wollen,
  k&ouml;nnen Sie durch Dr&uuml;cken von <b>F2</b> das Kontextfenster
  &ouml;ffnen; hier l&auml;sst sich die Form des Objektes mittels numerischer
  Werte anstatt miitels der Maus ver&auml;ndern (siehe dazu
  auch <a href="editing-points.html#F2">Bearbeiten von Punkten &ndash;
  numerisch</a>)</p>

  <p><b>Tipp:</b> Das Anklicken eines ausgew&auml;hlten Objekts mit
  gedr&uuml;ckter SHIFT-Taste w&auml;hlt es wieder ab.</p>
  <!--P> [ax006ho] Sie k&ouml;nnen Objekte mit dem
  Werkzeug <img src="../img/action.editorkit.Rotate.png" alt="Icon: Rotate" >
  drehen. Dazu dr&uuml;cken Sie die Maustaste I an dem Punkt, um den Sie das
  Objekt drehen wollen. Mit gedr&uuml;ckter linker Maustaste ziehen Sie ein
  (beliebige) Linie, die den Drehwinkel 0 Grad definiert. Lassen Sie die linke
  Maustaste los, es erscheint eine Hilfslinie, die den Drehwinkel anzeigt;
  bewegen Sie die Maus und das Objekt dreht sich entsprechend dem gezeigten
  Winkel um den Drehmittelpunkt. Ein Klicken auf die linke Maustaste beendet
  das Drehen.</P-->

  <h2>Mehrfach-Auswahl und Gruppen</h2>

  <p>Sie k&ouml;nnen eine <b>Mehrfach-Auswahl</b> erstellen, indem sie
  entweder w&auml;hrend des Ausw&auml;hlens
  die <kbd class="kbd">SHIFT</kbd>-Taste dr&uuml;cken oder die Objekte, die
  sie ausgew&auml;hlt haben wollen, mit dem Auswahlrechteck
  &bdquo;einh&uuml;llen&rdquo;; das Auswahlrechteck erzeugen sie durch Ziehen
  mit der Maus. Sie k&ouml;nnen dann <i>Verschiebungs-</i> und
  <i>Skalierungs-</i>Operationen durchf&uuml;hren, die Regeln dazu finden Sie
  im vorhergehenden Abschnitt.</p>

  <p>Sie k&ouml;nnen auch ausgew&auml;hlte Objekte <b>gruppieren</b>, sodass
  sie logisch miteinander verkn&uuml;pft sind. Das geschieht, indem Sie einen
  Klick mit der Maustaste II ausf&uuml;hren und im auftauchenden
  Popupmen&uuml; <b>Auswahl gruppieren</b> ausw&auml;hlen; nebenbei bemerkt:
  die Gruppen sind ineinander verschachtelbar. Um die Gruppierung von
  verkn&uuml;pften Objekten zu l&ouml;sen, klicken man mit der <b>Maustaste
  II</b> irgendwo in die ausgew&auml;hlte Gruppe um das Popupmen&uuml; zu
  &ouml;ffnen, in diesem w&auml;hlen Sie dann die &bdquo;<code>Gruppierung
  aufheben</code>&rdquo;-Option aus.</p>

  <h2>Das Bearbeiten von Winkeln bei Kreisb&ouml;gen</h2>

  <p>Sie k&ouml;nnen bei der Bearbeitung von Objekten zus&auml;tzliche
  geometrische Einschr&auml;nkungen definieren oder aufheben, indem Sie
  w&auml;hrend der Mausbewegung einige Modifikator-Tasten gedr&uuml;ckt
  halten. Zus&auml;tzlich zur Kombination von Modifikatoren, die auch schon
  in <a href="drawingcap.html">Das Zeichnen von Objekten</a> benutzt wurden,
  gibt es einen weiteren Modifikator, namentlich <kbd class="kbd">CTRL</kbd>.
  Dieser erm&ouml;glicht, die beiden Punkte, die den Start- und Endpunkt eines
  Bogens definieren, auch in dem Fall zu verschieben, dass ein solcher Start-
  oder Endpunkt mit einem Kontrollpunkt f&uuml;r die den Bogen definierende
  Ellipse zusammenf&auml;llt.  Letztere Punkte haben eine h&ouml;here
  Priorit&auml;t und somit w&uuml;rde das &Auml;ndern des Bogens zu einer
  &Auml;nderung der Ellipse f&uuml;hren, die Kontrollpunkte w&uuml;rden
  n&auml;mlich verschoben. Das Dr&uuml;cken von <kbd class="kbd">CTRL</kbd>
  dreht diesen Effekt und die Priorit&auml;t um und somit kann der Kreisbogen
  auch in diesem Fall ge&auml;ndert werden.</p>

  <h2>Kontextmen&uuml;s</h2>

  <p>Wenn Sie mit der mittleren Maustaste ein Objekt anklicken, erscheint
  ein <b>Kontextmen&uuml;</b>, mit dem Sie verschiedene Operationen auf dem
  Objekt ausf&uuml;hren k&ouml;nnen, so zum Beispiel das Umformen in eine
  andere Gestalt, das Bilden und Aufl&ouml;sen von Gruppen usw.</p>

  <p>Das unten stehende Bild zeigt das Kontextmen&uuml; f&uuml;r eine
  Bezier-Kurve/Polygon; dieses Kontextmen&uuml; erscheint auch im Zusammenhang
  mit den folgenden Objekten:</p>

  <ul>
    <li>Linie</li>

    <li>geschlossene Bezier-Kurve/Polygon</li>
  </ul>

  <p><img src="img/contextMenu.line.png" alt="Kontext-Men&uuml;: Linie" ></p>

  <p>Es gibt vier weitere Kontextmen&uuml;s, die Sie in der folgenden Tabelle
  mit den zugeh&ouml;rigen graphischen Objekten finden k&ouml;nnen</p>

  <table style="text-align:center" summary="Tabelle mit der Darstellung unterschiedlicher Kontext-Men&uuml;s">
    <tr>
      <td valign="top"><img src="img/contextMenu.polygon.png"
      alt="Kontext-Men&uuml;: Polygon" ></td>

      <td valign="top">
        <ul>
          <li>glattes Polygon</li>

          <li>geschlossenes Polygon</li>
        </ul>
      </td>
    </tr>

    <tr>
      <td valign="top"><img src="img/contextMenu.interpolationCurve.png"
      alt="Kontext-Men&uuml;: interpolierende Kurve" ></td>

      <td valign="top">
        <ul>
          <li>interpolierende Kurve</li>

          <li>geschlossene interpolierende Kurve</li>
        </ul>
      </td>
    </tr>

    <tr>
      <td valign="top"><img src="img/contextMenu.parallelogram.png"
      alt="Kontext-Men&uuml;: Parallelogramm" ></td>

      <td valign="top">
        <ul>
          <li>Rechteck</li>

          <li>Parallelogramm</li>
        </ul>
      </td>
    </tr>

    <tr>
      <td valign="top"><img src="img/contextMenu.ellipsis.png"
      alt="Kontext-Men&uuml;: Ellipse" ></td>

      <td valign="top">
        <ul>
          <li>Ellipse</li>

          <li>Tortenst&uuml;ck</li>

          <li>Kreisabschnitt</li>

          <li>Kreisbogen</li>

          <li>schiefe Ellipse</li>

          <li>Tortenst&uuml;ck (schief)</li>

          <li>Kreisabschnitt (schief)</li>

          <li>Kreisbogen (schief)</li>
        </ul>
      </td>
    </tr>
  </table>

  <p>Die Men&uuml;punkte haben im einzelnen die folgende Bedeutung (es
  h&auml;ngt vom jeweiligen Fall und Zusammenhang ab, welche Eintr&auml;ge
  aktiv sind bzw. &uuml;berhaupt angezeigt werden):</p>

  <dl>
    <dd>
      <hr>
    </dd>

    <dt>Geometrische Eigenschaften&hellip;</dt>

    <dd>zeigt die geometrischen Eigenschaften des jeweiligen Objektes in einem
    popup-Fenster an</dd>

    <dt>Pfad schlie&szlig;en</dt>

    <dd>macht aus der offenen Kurve eine geschlossene Kurve</dd>

    <dt>-&gt; Spline</dt>

    <dd>ersetzt das Objekt durch einen Spline mit denselben Ankerpunkten</dd>

    <dt>Alles gl&auml;tten</dt>

    <dd>vgl. dazu <a href="multicurve.html#straight">Zeichnen oder Bearbeiten
    &hellip;</a></dd>

    <dt>Alles symmetrisch machen</dt>

    <dd>vgl. dazu <a href="multicurve.html#straight">Zeichnen oder Bearbeiten
    &hellip;</a></dd>

    <dt>Alles gerade machen</dt>

    <dd>vgl. dazu <a href="multicurve.html#straight">Zeichnen oder Bearbeiten
    &hellip;</a></dd>

    <dt>Gerade machen</dt>

    <dd>vgl. dazu <a href="multicurve.html#straight">Zeichnen oder Bearbeiten
    &hellip;</a></dd>

    <dd>
      <hr>
    </dd>

    <dt>In den Hintergrund bringen</dt>

    <dd>Bilder werden sequentiell aufgebaut: sp&auml;ter gezeichnete Elemente
    k&ouml;nnen fr&uuml;her gezeichnete Elemente verdecken.  Durch Auswahl
    dieses Feldes wird das markierte Element zum &ldquo;zuerst&rdquo;
    gezeichneten Element, es r&uuml;ckt dadurch in den Hintergrund</dd>

    <dt>r&uuml;ckw&auml;rts</dt>

    <dd>das markierte Element wird in der Zeichenreihenfolge um eins nach
    hinten geschoben, es r&uuml;ckt sozusagen um eine Ebene
    r&uuml;ckw&auml;rts</dd>

    <dt>vorw&auml;rts</dt>

    <dd>das markierte Element wird in der Zeichenreihenfolge um eins nach
    hinten geschoben, es r&uuml;ckt sozusagen um eine Ebene
    r&uuml;ckw&auml;rts</dd>

    <dt>in den Vordergrund bringen</dt>

    <dd>vgl. Hintergrund, hier r&uuml;ckt das markierte Element in den
    Vordergrund</dd>

    <dd>
      <hr>
    </dd>

    <dt>Zeige LaTeX Datei</dt>

    <dd>zeigt die LaTeX Datei an, die zu dem aktuellen Bild (nicht zum Objekt)
    geh&ouml;rt</dd>

    <dt>Zeige &bdquo;Bounding Box&rdquo;</dt>

    <dd>Hiermit k&ouml;nnen Sie die tats&auml;chlichen Ausma&szlig;e des
    aktuellen Bildes ver&auml;ndern. Die Vorgabe sind die kleinste und die
    gr&ouml;&szlig;te x-Koordinate sowie die kleinste und die gr&ouml;&szlig;te
    y-Koordinate. Dies ist dann interessant, wenn Texte oder Kurven aus diesen
    Koordinaten herausragen.</dd>
  </dl>

  <h2><a name="Attribute" id="Attribute">Das &Auml;ndern graphischer
  Attribute</a></h2>

  <p>Graphische Attribute, wie z.B. Liniendicke, F&uuml;llfarbe &ndash; zum
  F&uuml;llen mit Farbe und/oder einem Muster vgl. <a href=
  "filling.html#Fill">Das F&uuml;llen von Fl&auml;chen</a> &ndash;,
  usw&hellip; k&ouml;nnen Sie ver&auml;ndern, indem Sie zuerst das zu
  ver&auml;ndernde Objekt ausw&auml;hlen und dann die gew&uuml;nschten Werte
  aus der im <b>Attribut-Editor</b> angebotenen Vielzahl von
  M&ouml;glichkeiten ausw&auml;hlt. Die verf&uuml;gbaren Attributen stehen in
  enger Beziehung zu den PSTricks Parametern, denn dieses LaTeX Paket bietet
  die gr&ouml;&szlig;te Spanne an M&ouml;glichkeiten.  Weitere Details lassen
  sich der <a href= "http://tug.org/PSTricks/doc/pst-usrfull.pdf">PSTricks
  Dokumentation</a> entnehmen.</p>

  <p><img src="img/werkzeugkasten.png" alt= "Werkzeugkasten: Editor f&uuml;r
  Attribute"></p>

  <p>&Auml;nderungen mancher Attribute werden nicht angezeigt, k&ouml;nnen
  aber dennoch im Attribut-Editor ge&auml;ndert werden; dies h&auml;ng vom
  momentanen Inhaltstyp ab. Insbesondere unterst&uuml;tzt die
  LaTeX <code>picture</code>-Umgebung nur eine sehr limitierte Teilmenge aller
  verf&uuml;gbaren Attribute (z.B.  keine Farbe, keine Textur, nur einfache
  Pfeile, keinen Schatten, &hellip;). Wenn Sie die volle Spanne von
  graphischen Attributen nutzen wollen, die vom Attribut-Editor zur
  Verf&uuml;gung gestellt wird, darunter fallen Schatten, Texturen und
  F&uuml;llen von Fl&auml;chen mit Farbe &ndash; zum F&uuml;llen mit Farbe
  und/oder einem Muster vgl. <a href="filling.html#Fill">Das F&uuml;llen von
  Fl&auml;chen</a> &ndash;, oder feink&ouml;rnigen gestrichelten Linien,
  sollten Sie undebingt dar&uuml;ber nachdenken auf den PSTricks Inhaltstyp zu
  wechseln, und <b>\usepackage{pstricks}</b> in Ihre LaTeX Dateien
  einzuf&uuml;gen. Sie werden es nicht bereuen, es lohnt sich!</p>
</body>
</html>
